Sara-uni/IoT-Project/Project_MSP432/src/init.c
#include "init.h"
#include "uart.h"
#include <ti/devices/msp432p4xx/driverlib/driverlib.h>
#include "LcdDriver/Crystalfontz128x128_ST7735.h"
#include "LcdDriver/HAL_MSP_EXP432P401R_Crystalfontz128x128_ST7735.h"
#include "HAL_I2C.h"
#include "HAL_TMP006.h"
#include <stdio.h>

//-----------------TEMPERATURE---------------------------

void _temperatureSensorInit()
{
    /* Temperature Sensor initialization */
    /* Initialize I2C communication */
    Init_I2C_GPIO();
    I2C_init();
    /* Initialize TMP006 temperature sensor */
    TMP006_init();
    __delay_cycles(100000);
}

//---------------------------------------------------

Graphics_Context g_sContext;

void _graphicsInit()
{
    /* Initializes display */
    Crystalfontz128x128_Init();

    /* Set default screen orientation */
    Crystalfontz128x128_SetOrientation(LCD_ORIENTATION_UP);

    /* Initializes graphics context */
    Graphics_initContext(&g_sContext, &g_sCrystalfontz128x128,
                         &g_sCrystalfontz128x128_funcs);
    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_RED);
    Graphics_setBackgroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);
    GrContextFontSet(&g_sContext, &g_sFontFixed6x8);
    Graphics_clearDisplay(&g_sContext);
}

void _hwInit()
{
    /* Halting WDT and disabling master interrupts */
    WDT_A_holdTimer();
    Interrupt_disableMaster();

    /* Set the core voltage level to VCORE1 */
    PCM_setCoreVoltageLevel(PCM_VCORE1);

    /* Set 2 flash wait states for Flash bank 0 and 1*/
    FlashCtl_setWaitState(FLASH_BANK0, 2);
    FlashCtl_setWaitState(FLASH_BANK1, 2);

    /* Initializes Clock System */
    CS_setDCOCenteredFrequency(CS_DCO_FREQUENCY_48);
    CS_initClockSignal(CS_MCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1);
    CS_initClockSignal(CS_HSMCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1);
    CS_initClockSignal(CS_SMCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1);
    CS_initClockSignal(CS_ACLK, CS_REFOCLK_SELECT, CS_CLOCK_DIVIDER_1);

    /* Configuring P1.0 as output */
    // GPIO_setAsOutputPin(GPIO_PORT_P1, GPIO_PIN0);
    // GPIO_setOutputLowOnPin(GPIO_PORT_P1, GPIO_PIN0);

    _graphicsInit();
    _temperatureSensorInit();
    _uartInit();
}

void _showTextTemp(char *string, float temp)
{
    Graphics_drawStringCentered(&g_sContext, (int8_t *)"CIAOO\nTemperature:",
                                AUTO_STRING_LENGTH, 64, 30, OPAQUE_TEXT);

    sprintf(string, "%.2f", temp);
    Graphics_drawStringCentered(&g_sContext, (int8_t *)string, 5, 55, 70,
                                OPAQUE_TEXT);

    sprintf(string, "C");
    Graphics_drawStringCentered(&g_sContext, (int8_t *)string, 5, 80, 70,
                                OPAQUE_TEXT);
}

void _showIP(char *ip)
{
    Graphics_drawStringCentered(&g_sContext, (int8_t *)"IP:",
                                AUTO_STRING_LENGTH, 64, 30, OPAQUE_TEXT);

    Graphics_drawStringCentered(&g_sContext, (int8_t *)ip, 5, 55, 70,
                                OPAQUE_TEXT);
}